Revit 2027 API
ViewSchedule.Split(IList<Double>) Method
 Splits the schedule into several segments by given height of each segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Split(
	IList<double> segmentHeights
)
Public Sub Split (
	segmentHeights As IList(Of Double)
)
public:
void Split(
	IList<double>^ segmentHeights
)
member Split :
        segmentHeights : IList<float> -> unit
Parameters
segmentHeights IList<Double>
 An array contains the height limit of each segment except the last segment. The height is the value for segment body. The height is Revit's internal units value.
Exceptions
Exception | Condition
ArgumentException |  The height of a schedule segment must be greater than 0 and no more than 30000 feet. The total segment count must be greater than 0 and less than 10000.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Revision schedules cannot be split. -or- A schedule filtered by sheet can't be split. -or- This ViewSchedule is split.
Remarks
A schedule can be split only when it is not split yet.
A titleblock revision schedule cannot be split.
Once a sheet specific schedule, i.e., the schedule is filtered by sheet, is split, the segments will be placed on its sheet view immediately.
The height values are used to set the height limits of the schedule instances of each segment except the last segment shown on the sheet view.
The height limit of the last segment cannot be set, because the height of the schedule instances of the last segment will be determined by the schedule instances of previous segments and the height of the whole schedule.
All height values must be greater than 0.
Also check [!:setSegmentHeight].
See Also
Reference
ViewSchedule Class
Split Overload
Autodesk.Revit.DB Namespace